# ID супергруппы (с включёнными Темами/Forum)
GROUP_CHAT_ID = -1002620513089

# Топики сотрудников (message_thread_id)
EMPLOYEE_THREADS = {
    "Курин Дмитрий Николаевич (ПРОРАБ)":   34,   # thread_id темы Курина
    "Курин Николай Николаевич": 48,
    "Суркис Данила Алексеевич (зам Димы)": 129,

    "Павловский Денис Владимирович (ПРОРАБ)": 2,
    "Войтенко Алексей Алексеевич": 508,
    "Поляков Павел Павлович": 505,
    "Ильменский Андрей Евгеньевич": 502,
    "Алябьев Олег Анатольевич": 499,
    "Маринин Василий Васильевич": 496,
    "Иванов Виктор Владимирович": 493,
    "Попов Андрей Александрович": 490,
    "Разгонов Илья Михайлович": 487,

    "Бурцев Константин Сергеевич": 663,
    "Акаев Камиль Камитович": 665,
    "Баландин Валерий Владимирович": 667,
    "Масленюк Иван Викторович": 669,
    "Машенцев Денис Михайлович": 671,
    "Нечаев Алексей Александрович": 673,
    "Нечаев Павел Михайлович": 675,
    "Штиб Дмитрий Владимирович": 677,
    "Куканов Алексей Владимирович": 679,
    "Михеев Денис Юрьевич": 681,
    "Щекутеев Александр Алексеевич": 683,
    "Кузнецов Андрей Витальевич": 685,
    "Сторонние рабочие": 687,
}

# Бригады 
BRIGADES = {
    "Курин Дмитрий Николаевич (ПРОРАБ)":   "A",
    "Курин Николай Николаевич": "A",
    "Суркис Данила Алексеевич (зам Димы)": "A",

    "Павловский Денис Владимирович (ПРОРАБ)":  "B",
    "Разгонов Илья Михайлович": "B",
    "Попов Андрей Александрович": "B",
    "Иванов Виктор Владимирович": "B",
    "Маринин Василий Васильевич": "B",
    "Алябьев Олег Анатольевич": "B",
    "Ильменский Андрей Евгеньевич": "B",
    "Поляков Павел Павлович": "B",
    "Войтенко Алексей Алексеевич": "B",

    "Бурцев Константин Сергеевич": "C",
    "Акаев Камиль Камитович": "C",
    "Баландин Валерий Владимирович": "C",
    "Масленюк Иван Викторович": "C",
    "Машенцев Денис Михайлович": "C",
    "Нечаев Алексей Александрович": "C",
    "Нечаев Павел Михайлович": "C",
    "Штиб Дмитрий Владимирович":"C",
    "Куканов Алексей Владимирович": "C",
    "Михеев Денис Юрьевич": "C",
    "Щекутеев Александр Алексеевич": "C",
    "Кузнецов Андрей Витальевич": "C",
    "Сторонние рабочие": "C",
}

RU_MONTHS = [
    "январь","февраль","март","апрель","май","июнь",
    "июль","август","сентябрь","октябрь","ноябрь","декабрь"
]
